package Cycles;

public class task5
    /*Напишите программу, которая выводит на экран «5,4,3,2,1» используя цикл for*/
{
    public static void main (String[] args)
    {
        int i;
        for (i = 5; i >1; i--)
        {
            System.out.print(i + ", ");
        }
        System.out.print(i);
    }
}
